content.org
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@
** Single Source Shortest Path
:PROPERTIES:
:ID:       363ab34d-14b4-4c35-921f-6e2f9f91aa92
:EXPORT_FILE_NAME: sssp
:END:

*** Synopsis

A single source shortest path algorithm discovers the shortest paths
between a single node and all the other nodes.  There are three algorithms
that can do this, depending on the situation.

  - Unweighted graphs use BFS
  - Weighted graphs with no negative edges use Dijkstra's algorithm
  - Weighted graphs with negative edges use the Bellman Ford algorithm.

*** Videos

  - [[/videos/bfs-shortest-path][BFS for Shortest Path]]
  - [[/videos/dijkstra-shortest-path][Dijkstra's Algorithm]]
  - [[/videos/bellman-ford-and-spfa][Bellman-Ford and SPFA]]

*** Recommended Reading

  - Competitive Programming 4, section 4.4

*** Problems

  - @@hugo:{{<UVa id="370" name="429 - Word Transformation" >}}@@

