content/lectures/sssp.md
+++
title = "Single Source Shortest Path"
author = ["Mattox Beckman"]
draft = false
type = "page"
+++

## Synopsis {#synopsis}

A single source shortest path algorithm discovers the shortest paths
between a single node and all the other nodes.  There are three algorithms
that can do this, depending on the situation.

-   Unweighted graphs use BFS
-   Weighted graphs with no negative edges use Dijkstra's algoritm
-   Weighted graphs with negative edges use the Bellman Ford algorithm.


## Videos {#videos}

-   [BFS for Shortest Path](/videos/bfs-shortest-path)
-   [Dijkstra's Algorithm](/videos/dijkstra-shortest-path)
-   [Bellman-Ford and SPFA](/videos/bellman-ford-and-spfa)


## Recommended Reading {#recommended-reading}

-   Competitive Programming 4, section 4.4


## Problems {#problems}

-   {{<UVa id="370" name="429 - Word Transformation" >}}
